<script setup>
// 第三方套件變數

// 自訂變數
const supervisorData = {
  columns: [
    { name: '職別', minWidth: 190, maxWidth: 190 },
    { name: '姓名', minWidth: 190, maxWidth: 190 },
    { name: '現職', minWidth: 380, width: '100%' }
  ],
  dataSource: [
    ['理事長', '謝繼茂', '中華電信(股)公司董事長'],
    ['常務理事', '王耀庭', '台灣電力(股)公司總經理'],
    [
      '常務理事',
      '李清庭',
      '國立成功大學電機資訊學院電機系名譽講座教授元智大學講座教授'
    ],
    ['常務理事', '林一平', '國立陽明交通大學資訊工程學系講座教授'],
    ['常務理事', '蘇炎坤', '國立成功大學智慧半導體及永續製造學院院長'],
    ['理事', '吳進忠', '台灣電力(股)公司專業總工程師'],
    ['理事', '李百祺', '國立台灣大學研發長'],
    ['理事', '卓政宏', '財團法人資訊工業策進會執行長'],
    ['理事', '林榮賜', '中華電信(股)公司執行副總經理'],
    ['理事', '施天從', '國立高雄科技大學電子工程系特聘教授'],
    ['理事', '張忠良', '台灣電力(股)公司副總經理'],
    ['理事', '張耀文', '國立台灣大學電機資訊學院院長'],
    ['理事', '郭大維', '國立台灣大學資訊工程學系特聘教授'],
    ['理事', '郭天合', '台灣電力(股)公司副總經理'],
    ['理事', '郭水義', '中華電信(股)公司總經理'],
    ['理事', '陳信宏', '國立陽明交通大學電機系講座教授'],
    ['理事', '陳柏宏', '國立陽明交通大學電子研究所所長'],
    ['理事', '楊正宏', '台南應用科技大學校長'],
    ['理事', '楊谷章', '國立中興大學電機資訊學院院長'],
    ['理事', '詹寶珠', '國立成功大學電資學院院長'],
    ['理事', '綦振瀛', '國立中央大學副校長'],
    ['常務監事', '郭斯彥', '國立台灣大學電機系特聘教授'],
    ['監事', '王晉良', '國立清華大學電機系特聘教授'],
    ['監事', '王蒞君', '國立陽明交通大學電機系講座教授'],
    ['監事', '廖婉君', '國立台灣大學電機系講座教授'],
    ['監事', '蘇添財', '中華電信個人家庭分公司總經理']
  ]
}
// 自訂函式

// lifeCycle
</script>
<template>
  <PageHeader />
  <section class="section-wrapper">
    <div class="mb-5 text-right leading-7">
      <p>民國112年－民國113年</p>
    </div>
    <h3 class="mb-10 font-semibold">第57屆理監事</h3>
    <Table
      :columns="supervisorData.columns"
      :dataSource="supervisorData.dataSource"
    />
  </section>
</template>
<style lang="scss" scoped></style>
