<script setup>
// 自訂變數
const awardData = {
  columns: [
    { name: '年度', minWidth: 190, maxWdith: 190 },
    { name: '姓名', minWidth: 380, width: '100%' }
  ],
  dataSource: [
    ['111', '王金龍、吳明儒、李榮瑞、周芳正、陳弘恩、陳光熙、廖正堅'],
    ['110', '王孝裕、吳進忠、林省揚、莊政宏、許仁源、簡大為、魏拯華'],
    ['109', '林銘祺、孫漢傑、張森嘉、黃子成、黃清輝、劉家隆、魏德輝'],
    ['108', '王建昌、王春山、高凌志、陳贊文、劉俊男'],
    ['107', '田銀錦、朱家珍、何秉衡、林昱仁、林啟豊、黃輝豹、賴豊文'],
    ['106', '林根勝、胡明廷、張志明、陳護木、游鴻修、蒲冠志、賴國英、謝文生'],
    ['105', '李秋德、洪宇能、洪基彬、郭威宏、陳宏毅、陳明崇、曾旭廷、曾榮和'],
    ['104', '林昭陽、林晃田、陳銘聰、黃有志、曾培哲、劉諄讓、薛榮銀'],
    [
      '103',
      '羅志成、康崇原、繆嘉新、林政廷、陳加珍、陳建堂、何家充、蕭純育、張棟梁、侯俊良、黃建文'
    ],
    ['102', '王智充、甘果碩、黃振國、葉永輝、廖崑亮、蔡坤成、賴國祥、蘇耀焜'],
    ['101', '張　平、張保忠、陳光榮、湯鴻沼、葉恩明、劉培文、鄭  鉉、蕭勝任'],
    ['100', '李麗玲、許文通、陳元凱、陳鏡明、劉火炎、劉演鎮、蔡其達、謝東明'],
    ['99', '朱俊勳、馬瑞良、楊金石、賈仲雍、羅耿介'],
    ['98', '朱煜煌、洪永輝、曾紹崟'],
    ['97', '胡鴻烈、桂人傑、丁邦安、傅紅貴、吳麗秀、孫啟光、楊文豪'],
    ['96', '陳錦洲、何鴻鈞、祁錦雲、何宗哲'],
    ['95', '羅桂林、張嘉祥、王井煦、吳國瑞、陳立哲'],
    ['94', '張忠良、張志偉、劉俊宏、施教鋆'],
    ['93', '吳永村、簡山傑、黃郁文'],
    ['92', '吳奇雄、楊明宗、張昭琳'],
    ['91', '高靖智、涂元光、馬金溝'],
    ['90', '林湧雄、張錦德、周鐘平'],
    ['89', '劉明宗、謝萬發、鍾炳利'],
    ['88', '何世江、顏清輝、陳松田'],
    ['87', '孫世偉、梁志堅、黃秀谷'],
    ['86', '呂道鴻、郭芳源']
  ]
}

const fileDatas = reactive([
  {
    fileName: '傑出電機工程師獎榮譽榜.docx',
    path: '/files/榮譽榜/傑出電機工程師獎榮譽榜.docx'
  }
])

// lifeCycle
</script>
<template>
  <PageHeader />
  <section class="section-wrapper">
    <div class="mb-20 leading-7">
      本會為表揚優秀工程師會員，以激勵電機工程之發展，特設置「傑出電機工程師獎」。<br />本獎於每年會員大會時頒發。
    </div>
    <Table :columns="awardData.columns" :dataSource="awardData.dataSource" />
    <FileDownload class="mt-[60px] md:mt-20 xl:mt-[120px]" :files="fileDatas" />
  </section>
</template>
<style lang="scss" scoped></style>
