<script setup>
// 自訂變數
const awardData = {
  columns: [
    { name: '年度', minWidth: 190, maxWidth: 190 },
    { name: '姓名', minWidth: 380, width: '100%' }
  ],
  dataSource: [
    [
      '111',
      '王奕翔、李俊興、林家祥、楊尚樺、劉昌樺、謝易叡、呂天桂、連唯証、黃信捷、楊長恩、蔡東展'
    ],
    [
      '110',
      '邱維辰、陳坤志、彭朋瑞、彭徐鈞、解巽評、李育緯、林宗禧、姚竺君、張志嘉、謝泊頷'
    ],
    [
      '109',
      '李祈均、邱偉育、陳永耀、陳瑄易、黃仁暐、王恩慈、周逸凡、陳佳慶、陳承輝、陳澤民'
    ],
    [
      '108',
      '方劭云、古孟霖、沈之涯、郭文興、黃朝宗、高志強、曾蕙如、鄭人瑋、闕壯華、蘇亞凡'
    ],
    [
      '107',
      '吳肇欣、李宏毅、李濬屹、陳柏宏、劉怡君、賴慶明、林群惟、施汎勳、張欣宏、陳政宏、劉彥良'
    ],
    [
      '106',
      '方士豪、王學誠、朱威達、林春成、鍾偉和、鍾耀梁、李建德、林東穎、陳彥仲、馮鼎程、黎煥中'
    ],
    [
      '105',
      '毛敬豪、陳正一、陳柏戎、陳恒殷、黃培棠、黃毅軍、葉宜函、廖育德、劉維昇、鄭旭詠、鄭淳護'
    ],
    [
      '104',
      '朱益宏、李勝偉、巫昇峰、林　澤、林英超、林俊隆、施皇嘉、翁孟君、曹宏熙、楊家驤、鄭文皇'
    ],
    [
      '103',
      '吳宏偉、魏宏宇、李欣縈、吳文偉、林柏宏、黃清輝、劉順德、林省揚、張原豪、顏精一、張道智、邱簡謙'
    ],
    [
      '102',
      '何志浩、何宗易、李夢麟、周佩廷、彭文孝、黃乙白、黃亮橋、楊得年、董元昕、鄒福明、劉浩澧、蔡育嘉'
    ],
    [
      '101',
      '王家慶、王郁仁、巫啟生、周志勳、林祐生、洪樂文、馬自莊、莊棨椉、陳正中、陳冠能、簡韶逸'
    ],
    [
      '100',
      '江蕙如、李柏璁、莊政宏、郭景明、彭文志、黃怡碩、葉家宏、劉昌和、劉家宏、顏均泰'
    ],
    [
      '99',
      '冉曉雯、李瑞光、林洋鑫、林靖淵、林嘉慶、張錫嘉、郭倫嘉、陳昇瑋、黃稚存、羅豐祥'
    ],
    [
      '98',
      '王俊堯、李柏磊、李致毅、胡仲華、胡堂祥、徐達儒、徐碩鴻、陳文泉、鄭　傑、賴國英'
    ],
    [
      '97',
      '黃建璋、馮輝文、陳弼先、徐惇穎、蕭昌龍、黃介一、陳進祥、李進福、陳志明、盧廷昌'
    ],
    [
      '96',
      '張添烜、劉柏村、方凱田、曹孝櫟、高境鴻、林佑昇、許晉瑋、逄愛君、陳慶永'
    ],
    [
      '95',
      '林　風、蔡榮輝、李義明、陳美娟、陳瓊璋、金雅琴、吳文慶、范國寶、洪建中'
    ],
    [
      '94',
      '林恭如、李國賓、李佩雯、何家充、何鏡波、徐裕峰、馮世邁、林源倍、李順裕'
    ],
    [
      '93',
      '郭峻因、梁佳文、魏榮宗、黃燕昌、林榮賜、廖顯奎、吳安宇、高明哲、陳芳祝'
    ],
    ['92', '周錫增、吳忠幟、楊谷章、曾文鵬、方士庭、柯偉震'],
    ['91', '李百祺、黃文吉、黃世杰、劉致為、李正中、吳宗霖'],
    ['90', '周志文、劉志文、張玉盈、劉俊宏、黃崇明、黃衍介'],
    ['89', '王博民、李文彬、林法正、張繼禾、楊谷洋、鄭志祥'],
    ['88', '張守進、蔡清池、陳秋麟、李大嵩、劉啟民、游萃蓉'],
    ['87', '林一平、洪啟智、翁金輅、崔秉鉞、張志聲、陳清棋'],
    ['86', '陳錫明、郭泰豪、蔡清霖、鄭國順']
  ]
}
const fileDatas = reactive([
  {
    fileName: '優秀青年電機工程師獎榮譽榜.docx',
    path: '/files/榮譽榜/優秀青年電機工程師獎榮譽榜.docx'
  }
])

// 自訂函式

// lifeCycle
</script>
<template>
  <PageHeader />
  <section class="section-wrapper">
    <div class="mb-20 leading-7">
      本會為表揚優秀工程教授及優秀工程師會員，以激勵電機工程之發展，特設置「優秀青年電機工程師獎」。<br />本獎於每年會員大會時頒發。
    </div>
    <Table :columns="awardData.columns" :dataSource="awardData.dataSource" />
    <FileDownload class="mt-[60px] md:mt-20 xl:mt-[120px]" :files="fileDatas" />
  </section>
</template>
<style lang="scss" scoped></style>
