<script setup>
// 自訂變數
const awardData = {
  columns: [
    { name: '年度', minWidth: 190, maxWidth: 190 },
    { name: '姓名', minWidth: 380, width: '100%' }
  ],
  dataSource: [
    ['111', '林家民、邱天隆、邱博文、洪樂文、彭文孝、黃建璋、楊朝棟'],
    [
      '110',
      '朱家齊、朱聖緣、巫勇賢、林春成、林祐生、施吉昇、張盛富、張傳育、楊家驤'
    ],
    [
      '109',
      '王俊堯、林嘉慶、祁忠勇、姚賀騰、張振豪、陳美娟、彭文志、劉浩澧、謝志成、蘇炫榮'
    ],
    ['108', '何宗易、林嘉文、侯拓宏、曹孝櫟、莊家峰、楊宏澤、盧廷昌'],
    ['107', '江蕙如、吳文偉、李柏磊、徐宏民、翁詠祿、楊佳玲、趙昌博、鄭桂忠'],
    ['106', '吳宏偉、李欣縈、林志隆、馬自莊、張孟凡、張原豪、湯敬文'],
    ['105', '冉曉雯、江昭皚、張鴻埜、郭景明、陳科宏'],
    [
      '104',
      '呂海涵、李佩雯、李進福、林佑昇、逄愛君、陳培殷、楊正宏、廖顯奎、劉柏村'
    ],
    ['103', '孫宏民、蔡清池、曾新穆、郭泰豪、謝續平、陳冠能、郭浩中、劉志文'],
    ['102', '周世傑、林恭如、邱煥凱、張文恭、張世杰、陳志成、黃柏仁、謝孫源'],
    ['101', '吳炳飛、林　風、杭學鳴、洪瑞華、梁從主、楊谷章、廖聰明、簡仁宗'],
    [
      '100',
      '吳孟奇、吳忠幟、吳宗憲、李大嵩、李鎮宜、林志民、林惠民、曾永華、華志強、黃婷婷'
    ],
    ['99', '王晉良、吳安宇、郭峻因、陳朝順、陳曉華、楊家輝、魏榮宗'],
    ['98', '王蒞君、王進賢、李同益、周錫增、林清富、柯明道、張耀文'],
    ['97', '李允中、盧展南、許渭州、姚立德、陳宏銘、徐國鎧、張　翼'],
    ['96', '劉添華、王朝欽、李國賓、張守進、郭大維、林俊良、周志宏'],
    ['95', '洪西進、吳財福、鍾世忠、周景揚、李明逵、呂學士、洪穎怡、廖婉君'],
    ['94', '陳信宏、吳家麟、闕志達、曾煜棋、李百祺、林法正、黃世杰'],
    ['93', '王永和、黃　威、綦振瀛、劉濱達'],
    ['92', '翁金輅、陳少傑、李清庭'],
    ['91', '陳錫明、任建葳、王文俊'],
    ['90', '莊紹勳、張真誠、陳永昌'],
    ['89', '尉應時、陳斌魁、曾俊元'],
    ['88', '劉昌煥、莊晴光、吳瑞北'],
    ['87', '貝蘇章'],
    ['86', '蘇炎坤、吳誠文、林進燈']
  ]
}
const fileDatas = reactive([
  {
    fileName: '傑出電機工程教授獎榮譽榜.docx',
    path: '/files/榮譽榜/傑出電機工程教授獎榮譽榜.docx'
  }
])

// lifeCycle
</script>
<template>
  <PageHeader />
  <section class="section-wrapper">
    <div class="mb-20 leading-7">
      本會為表揚優秀工程教授會員，以激勵電機工程之發展，特設置「傑出電機工程教授獎」。<br />本獎於每年會員大會時頒發。
    </div>
    <Table :columns="awardData.columns" :dataSource="awardData.dataSource" />
    <FileDownload class="mt-[60px] md:mt-20 xl:mt-[120px]" :files="fileDatas" />
  </section>
</template>
<style lang="scss" scoped></style>
