<script setup>
// 第三方套件變數

// 自訂變數
const awardData = [
  {
    title: '111年度 第一名',
    columns: [
      { name: '畢業學校', minWidth: 200, maxWidth: 200 },
      { name: '作者姓名', minWidth: 150, maxWidth: 150 },
      { name: '指導教授', minWidth: 150, maxWidth: 150 },
      { name: '論文題目', minWidth: 380, width: '100%' }
    ],
    dataSource: [
      [
        '國立陽明交通大學\n電子研究所',
        '吳易軒',
        '柯明道',
        '應用於製造場所靜電放電控制的天線驅動靜電放電事件偵測器設計'
      ],
      [
        '國立成功大學\n電機研究所',
        '孫偉皓',
        '郭泰豪',
        '高音質全尺寸輸出功率範圍之數位輸入D類音頻放大器'
      ],
      [
        '國立臺灣大學\n電機工程學研究所',
        '陳柏志',
        '陳政維',
        '嬰兒心臟外科手術系統設計與評估'
      ]
    ]
  },
  {
    title: '111年度 第二名',
    columns: [
      { name: '畢業學校', minWidth: 200, maxWidth: 200 },
      { name: '作者姓名', minWidth: 150, maxWidth: 150 },
      { name: '指導教授', minWidth: 150, maxWidth: 150 },
      { name: '論文題目', minWidth: 380, width: '100%' }
    ],
    dataSource: [
      [
        '國立清華大學\n電機工程研究所',
        '翁笠群',
        '黃朝宗',
        '適用於雙層分解式三維顯示器之光場分解處理器超大型積體電路設計'
      ],
      [
        '國立清華大學\n資訊系統與應用研究所',
        '陳姵珮',
        '王俊堯',
        '一種用於抵禦基於布林滿足性的破解法之增強式迴路化邏輯加密技術的研究'
      ],
      [
        '國立陽明交通大學\n電機工程研究所',
        '陳靖翔',
        '廖育德',
        '具備可調節週期控制迴路之433-MHz 線性調頻傳輸機'
      ]
    ]
  },
  {
    title: '111年度 第三名',
    columns: [
      { name: '畢業學校', minWidth: 200, maxWidth: 200 },
      { name: '作者姓名', minWidth: 150, maxWidth: 150 },
      { name: '指導教授', minWidth: 150, maxWidth: 150 },
      { name: '論文題目', minWidth: 380, width: '100%' }
    ],
    dataSource: [
      [
        '國立中興大學\n通訊工程研究所',
        '王煜翔',
        '楊谷章',
        '在感知無線電網路具漸近最佳週期通道跳頻碼之建構與分析'
      ],
      [
        '國立清華大學\n資訊工程研究所',
        '留孝倫',
        '王俊堯',
        '一個利用邏輯無關項來減少邏輯電路之乘法複雜度的方法'
      ],
      [
        '國立臺灣大學\n電子工程學研究所',
        '張燿均',
        '李峻霣\n陳士元',
        '應用於大規模量子位元自旋操控之電子自旋共振蜿蜒線'
      ],
      [
        '國立中央大學\n電機工程學研究所',
        '莊競輝',
        '林祐生',
        '單頻和雙頻帶可重組式微波被動元件'
      ],
      [
        '國立陽明交通大學\n人工智慧技術與應用碩士學位學程',
        '黃品瑞',
        '鄭文皇',
        '應用因果學習於提升面部表情辨識穩健性'
      ],
      [
        '國立臺灣大學\n電信工程學研究所',
        '詹昀穎',
        '陳士元',
        '基於交叉偶極負載裂環之雙圓極化反射式陣列天線'
      ],
      [
        '國立臺灣大學\n電信工程學研究所',
        '劉沛穎',
        '林　澤',
        '使用輕量化自注意力機制在高缺值時序列電子醫療病歷上的應用'
      ],
      [
        '國立陽明交通大學\n電子研究所',
        '蔡德凱',
        '崔秉鉞',
        '使用P型隔離結構實現4H型碳化矽互補式金氧半場效電晶體與垂直雙擴散金氧半場效電晶體之單晶片功率積體電路'
      ],
      [
        '國立陽明交通大學\n電子研究所',
        '簡煒值',
        '陳巍仁',
        '一個無參考時脈且具有背景自我校正技術之相位雜訊量測電路'
      ]
    ]
  },
  {
    title: '111年度 佳作',
    columns: [
      { name: '畢業學校', minWidth: 200, maxWidth: 200 },
      { name: '作者姓名', minWidth: 150, maxWidth: 150 },
      { name: '指導教授', minWidth: 150, maxWidth: 150 },
      { name: '論文題目', minWidth: 380, width: '100%' }
    ],
    dataSource: [
      [
        '國立中央大學\n電機工程學研究所',
        '吳育承',
        '林祐生',
        '基於可重組式微波元件之測速雷達系統'
      ],
      [
        '國立成功大學\n電機研究所',
        '呂柏辰',
        '林家民',
        '基於創新的部分佔用邊角縫織之三維模塊擺置設計流程'
      ],
      [
        '國立成功大學\n微電子研究所',
        '林秉陞',
        '劉文超',
        '鋁摻雜氧化鋅化學電阻式氣體感測器之研製'
      ],
      [
        '國立臺灣大學\n電子工程學研究所',
        '高禎謙',
        '楊家驤',
        '適用於毫米波巨量天線系統之混合預編碼處理器設計與實現'
      ],
      [
        '國立成功大學\n光電研究所',
        '許峻瑜',
        '黃勝廣',
        '利用對稱偶合條件下的兩個相互耦合注入半導體雷射光學系統進行亂數產生'
      ],
      [
        '國立臺灣大學\n電子工程學研究所',
        '黃友杉',
        '江介宏',
        '基於神經網路與決策圖之電路學習'
      ],
      [
        '國立清華大學\n電子工程研究所',
        '黃永舜',
        '劉怡君',
        '毫米波應用於5G行動通訊之相位陣列發射機前端設計'
      ]
    ]
  }
]

const fileDatas = reactive([
  {
    fileName: '青年論文獎榮譽榜.docx',
    path: '/files/榮譽榜/青年論文獎榮譽榜.docx'
  }
])

// lifeCycle
</script>
<template>
  <PageHeader />
  <section class="section-wrapper">
    <div class="mb-20 leading-7">
      本會為鼓勵國內碩士班研究生研究風氣，提升論文水準，特設置「青年論文獎」。<br />本獎名額：<br />第一名3篇，每篇獎金2萬元整，獎狀乙紙。<br />第二名3篇，每篇獎金1萬元整，獎狀乙紙。<br />第三名9篇，每篇獎金5千元整，獎狀乙紙。<br />佳作若干篇，每篇獎金2千元整，獎狀乙紙。<br />本獎於每年會員大會時頒發。
    </div>
    <section v-for="yearData in awardData" :key="yearData.title" class="mb-20">
      <h4 class="mb-10 font-semibold">{{ yearData.title }}</h4>
      <Table
        class="whitespace-pre-wrap"
        :columns="yearData.columns"
        :dataSource="yearData.dataSource"
      />
    </section>
    <FileDownload class="mt-[60px] md:mt-20 xl:mt-[120px]" :files="fileDatas" />
  </section>
</template>
<style lang="scss" scoped></style>
