<script setup>
// 自訂變數
const data = reactive({
  lastUpdate: '111.07.29本會第56屆第5次理監事聯席會議修正通過',
  title: '中國電機工程學會「會士」遴選辦法',
  list: [
    {
      title: '第一條',
      text: '中國電機工程學會(以下簡稱本會)為表彰本會會員在電力、電信、電子、資訊等電機相關領域之傑出貢獻，特訂定本辦法。'
    },
    {
      title: '第二條',
      text: '會士之定義：',
      content: {
        type: 'str',
        txt: '本會會員為國內外傑出之學者、研究人員、工程師及管理階層，對電力、電信、電子、資訊等電機相關領域之發展不遺餘力，且對國家社會、工程技術或本會會務有重大貢獻者，經本會遴選產生之終身榮銜。'
      }
    },
    {
      title: '第三條',
      text: '會士候選人之基本資格及推薦方式：',
      content: {
        type: 'orderlist',
        list: [
          {
            txt: '1.具本會永久會員或至少連續五年以上正會員之會籍者，並獲本會正會員五位以上或會士二人以上之推薦。'
          },
          {
            txt: '2.由本會會士遴選委員會委員主動推薦。'
          }
        ]
      }
    },
    {
      title: '第四條',
      text: '迴避條款：',
      content: {
        type: 'str',
        txt: '本會現任理事長、現任理監事、現任會士遴選委員會委員不得為當年會士候選人。'
      }
    },
    {
      title: '第五條',
      text: '會士之產生與名額：',
      content: {
        type: 'orderlist',
        list: [
          {
            txt: '1.曾擔任本會理事長或獲選為本會獎章得獎人並經第三條所列之方式被推薦者，為本會當然會士。'
          },
          {
            txt: '2.推薦會士候選人需檢附以下相關資料，於每年8月30日前送交本會：',
            sublist: [
              '(1)本會會士遴選推薦表，依表格規定詳述相關傑出事蹟說明，包括中文三十字(含)以內之得獎理由（citation），表格樣本如所附。',
              '(2)推薦可附推薦函，但以三份為限。',
              '(3)其他有利審查之個人資料。'
            ]
          },
          {
            txt: '3.會士由本會會士遴選委員會投票產生，遴選委員不克出席會議時，得於預先詳閱所有候選人資料後以書面投票，但本會必須在會議開始前收到密封之選票，方為有效。遴選委員會召開會議時必須有過半數以上之委員出席，決定會士當選人名單之會議則必須有四分之三(含)以上委員參與投票(含預先投票)，但同一會議第二次以上投票則不受此限。會士當選人需得票超過全部票數(含預先投票)三分之二(含)以上，且除前三年外每年以5人為限；當選人未達5人且候選人得票二分之一(含)以上，得進入第二次投票；另第一、二年會士以10人為限，第三年以8人為限；但上述人數限制不包括由本條第1款所產生者。'
          }
        ]
      }
    },
    {
      title: '第六條',
      text: '會士遴選委員會：',
      content: {
        type: 'str',
        txt: '會士遴選委員會設主任委員1人，委員若干人，委員均須為本會會士，任期三年，連聘得連任，每年由當年度本會理事長邀聘其中三分之一。第一屆會士遴選委員會由理事長從現任或前任理事會成員中邀聘，其中三分之一任期一年，三分之一任期兩年。第二年、第三年所邀聘之三分之一可為本會會士。'
      }
    },
    {
      title: '第七條',
      text: '當選之會士，須申請成為本會永久會員。'
    },
    {
      title: '第八條',
      text: '會士當選表揚：',
      content: {
        type: 'str',
        txt: '每年當選之會士於本會當年度年會中公開表揚，並頒發會士當選證書。'
      }
    },
    {
      title: '第九條',
      text: '本會士遴選辦法經本會理事會通過後公佈施行，修正時亦同。'
    }
  ]
})
const fileDatas = reactive([
  { fileName: '會士遴選辦法.pdf', path: '/files/獎項評選/會士遴選辦法.pdf' },
  {
    fileName: '會士遴選推薦表.docx',
    path: '/files/獎項評選/會士遴選推薦表.docx'
  }
])
// 自訂函式
// lifeCycle
</script>
<template>
  <PageHeader />
  <section class="section-wrapper">
    <SelectionRules
      :last-update="data.lastUpdate"
      :title="data.title"
      :list="data.list"
    />
    <FileDownload class="mt-[60px] md:mt-20 xl:mt-[120px]" :files="fileDatas" />
  </section>
</template>
<style lang="scss" scoped></style>
