<script setup>
const data = reactive({
  lastUpdate: '104.10.29本會第53屆第3次理事會議修正通過',
  title:
    '中國電機工程學會『傑出電機工程教授獎』、『傑出電機工程師獎』及『優秀青年電機工程師獎』評選辦法',
  list: [
    {
      title: '第一條',
      text: '中國電機工程學會（以下簡稱本會）為表揚優秀工程教授及優秀工程師會員，以激勵電機工程之發展，特設置「傑出電機工程教授獎」、「傑出電機工程師獎」、及「優秀青年電機工程師獎」（以下簡稱本獎）。'
    },
    {
      title: '第二條',
      text: '凡本會會員，符合下列條件者，得為「傑出電機工程教授獎」候選人。',
      content: {
        type: 'orderlist',
        list: [
          {
            txt: '（一）專職我國公私立大專院校電機工程相關科系之專任教授或副教授，且未曾獲本獎之本會會員。'
          },
          {
            txt: '（二）對我國電機工程實務或工程教育有傑出成就者。'
          },
          {
            txt: '（三）永久會員或連續三年繳納常年會費之正級會員。'
          }
        ]
      }
    },
    {
      title: '第三條',
      text: '凡本會會員，符合下列條件者，得為「傑出電機工程師獎」候選人。',
      content: {
        type: 'orderlist',
        list: [
          {
            txt: '（一）至推荐截止日，年滿四十歲，且未曾獲本獎之本會會員。'
          },
          {
            txt: '（二）克服電機工程困難，領導電機工程團隊或在電機工程研究發展上有傑出成就者。'
          },
          {
            txt: '（三）教職身分不予接受推薦。'
          },
          {
            txt: '永久會員或連續三年繳納常年會費之正級會員。'
          }
        ]
      }
    },
    {
      title: '第四條',
      text: '凡本會會員，符合下列條件者，得為「優秀青年電機工程師獎」候選人。',
      content: {
        type: 'orderlist',
        list: [
          {
            txt: '（一）至推荐截止日，未滿四十歲，並在同一機構連續服務滿三年，且未曾獲本獎之本會會員。'
          },
          {
            txt: '（二）在電機工程之研究發展上或電機工程服務上有優良表現者。'
          },
          {
            txt: '（三）永久會員或連續三年繳納常年會費之正級會員。'
          }
        ]
      }
    },
    {
      title: '第五條',
      text: '本獎之候選人採下列推薦方式甄選：',
      content: {
        type: 'orderlist',
        list: [
          {
            txt: '（一）本會分會或團體會員推薦。'
          },
          {
            txt: '（二）國內大專院校電機或相關科、系(所)推薦。'
          },
          {
            txt: '（三）國內工程學術機構、工程研究機構、工程建設機構或工程實務機構推薦。'
          }
        ]
      }
    },
    {
      title: '第六條',
      text: '本獎之評選作業程序如下：',
      content: {
        type: 'orderlist',
        list: [
          {
            txt: '（一）每年以本會名義函邀本會各分會及團體會員、各大專院校電機或相關科、系(所)、各機構推薦。'
          },
          {
            txt: '（二）推薦機構應填具本會規定之推薦表，並檢附有關被推薦人之資料及優良事蹟，於推薦截止日前（以郵戮為憑）送本會獎勵委員會審查。'
          },
          {
            txt: '（三）獎勵委員會於完成候選人之初審後，可就審查合格之候選人進行訪查，必要時得邀請候選人進行面談。'
          },
          {
            txt: '（四）初評完成後，依下列原則進行最後決選。初評完成後，依下列原則進行最後決選。',
            sublist: [
              '1.獎勵委員應親自出席評審會議，無法出席者，可書面委託其他委員代理出席，每人僅能代理一位。',
              '2.本會開會時需有過半數委員出席方得開議，投票採無記名方式，每名候選人得票率須達出席委員過半數，並依最高票順序當選之。'
            ]
          },
          {
            txt: '（五）「傑出電機工程教授獎」當選人每年以七名為原則，「傑出電機工程師獎」當選人每年以七名為原則，「優秀青年電機工程師獎」當選人每年以十名（學術界及工程界各半，並包含電力、電信、電子、資訊等專長）為原則。'
          }
        ]
      }
    },
    {
      title: '第七條',
      text: '本會獎勵委員會應將評選結果提報理事會核定。'
    },
    {
      title: '第八條',
      text: '本獎於每年會員大會時頒發。'
    },
    {
      title: '第九條',
      text: '本辦法經本會理事會通過後施行，修正時亦同。'
    }
  ]
})
const fileDatas = reactive([
  { fileName: '三獎評選辦法.pdf', path: '/files/獎項評選/三獎評選辦法.pdf' },
  {
    fileName: '優秀青年電機工程師獎候選人推薦表.docx',
    path: '/files/獎項評選/優秀青年電機工程師獎候選人推薦表.docx'
  }
])
// 自訂函式

// lifeCycle
</script>
<template>
  <PageHeader />
  <section class="section-wrapper">
    <SelectionRules
      :is-indent-required="true"
      :last-update="data.lastUpdate"
      :title="data.title"
      :list="data.list"
    />
    <FileDownload class="mt-[60px] md:mt-20 xl:mt-[120px]" :files="fileDatas" />
  </section>
</template>
<style lang="scss" scoped></style>
