<script setup>
// 自訂變數
const data = reactive({
  lastUpdate: '108.03.20本會第55屆第2次聯席理事會議修正通過',
  title: '中國電機工程學會獎章委員會簡章',
  list: [
    {
      title: '第一條',
      text: '本委員會根據中國電機工程學會會章第十二條之規定組織之。'
    },
    {
      title: '第二條',
      text: '本委員會置主任委員一人，委員八至十二人，由本會理事長提名，經理事會通過後聘任之。'
    },
    {
      title: '第三條',
      text: '本委員會開會時由主任委員召集之，並擔任主席，主任委員如臨時因事不能出席時．由委員中互推一人為主席。'
    },
    {
      title: '第四條',
      text: '本委員會之任務如下：',
      content: {
        type: 'orderlist',
        list: [
          {
            txt: '（一）獎章候選人之資歷及著作發明或其他有關證件之審查。'
          },
          {
            txt: '（二）獎章候選人最後推薦之決定。'
          }
        ]
      }
    },
    {
      title: '第五條',
      text: '本會設學術研究、工程事業等兩類工程獎章，每年各頒授一座。'
    },
    {
      title: '第六條',
      text: '凡本會個人會員（永久會員及正級會員）入會滿一年，合於下列條件之一者，得為各類獎章候選人，推薦時只能擇一類推薦。',
      content: {
        type: 'orderlist',
        list: [
          {
            txt: '（一）學術研究類：專職我國公私立大專院校電機工程相關科系之專任教授，在電機學術上有顯著之成就重大之發明或有價值之著作者。'
          },
          {
            txt: '（二）工程事業類：電機工程上有顯著之成就重大之發明或有價值之著作者或主辦電機工程建設對國家社會有重大貢獻者。'
          }
        ]
      }
    },
    {
      title: '第七條',
      text: '凡合於第六條規定之個人會員，經本會個人會員三人以上或由獎章委員會委員或由團體會員之提名得為獎章候選人。本委員會根據各方面所推人選負責審查（必要時得邀請專家共同辦理），並採用無記名投票方式，經過半數委員出席，出席委員過半數以上贊成者，始得當選，於會員大會前一個月以全體委員名義向本會理事會推薦，由理事會作最後決定，每年各類獎章得獎人以一人為限，如無適當人選時得從缺。'
    },
    {
      title: '第八條',
      text: '本委員會根據各方面所推人選負責審查（必要時得邀請專家共同辦理），並採用無記名投票方式，經過半數委員出席，出席委員過半數以上贊成者，始得當選，於會員大會前一個月以全體委員名義向本會理事會推薦，由理事會作最後決定，每年各類獎章得獎人以一人為限，如無適當人選時得從缺。'
    },
    {
      title: '第九條',
      text: '被提名之候選人姓名以及審查經過均應保守秘密，最後決定之推薦人選，亦不得由本委員會以任何方式向外發表。'
    },
    {
      title: '第十條',
      text: '獎章之頒發於每年會員大會時行之，此項獎章為代表電機工程界之最高榮譽。當年度學術研究類得獎人，除由本會頒發獎章，另由本會向財團法人中技社申請委託本會辦理「中技社電機學術獎」獎金頒發得獎人。'
    },
    {
      title: '第十一條',
      text: '本委員會簡章經本會理事會通過後施行，修正時亦同。'
    }
  ]
})
const fileDatas = reactive([
  {
    fileName: '獎章委員會簡章.pdf',
    path: '/files/獎項評選/獎章委員會簡章.pdf'
  },
  {
    fileName: '電機工程獎章候選人推薦表.docx',
    path: '/files/獎項評選/電機工程獎章候選人推薦表.docx'
  }
])
// 自訂函式
// lifeCycle
</script>
<template>
  <PageHeader />
  <section class="section-wrapper">
    <SelectionRules
      :isIndentRequired="true"
      :last-update="data.lastUpdate"
      :title="data.title"
      :list="data.list"
    />
    <FileDownload class="mt-[60px] md:mt-20 xl:mt-[120px]" :files="fileDatas" />
  </section>
</template>
<style lang="scss" scoped></style>
